package bg.tu_varna.sit;
/*Закусвалня разполага с приготвени 289 банички. Пред нея се е заформила опашка, като е
установено, че на всеки трима чакащи първият си купува по две банички, вторият – по четири, а
третият – една. Разпишете програма, с която да се установи колко души ще могат да си купят
закуски от закусвалнята. Последният, за който има налични количества, ще успее ли да купи
всички закуски, които е планирал?*/

public class Main {

    public static void main(String[] args) {
	// write your code here
            int банички = 290;
            int[] quantity = {2, 4, 1};
            int i = 1;
            int n = 0;
            while (банички != 0) {
                if (банички > quantity[i - 1]) {
                    банички -= quantity[i - 1];
                    i++;
                    n++;
                    if (i == 4) {
                        i = 1;
                    }
                } else if (банички == quantity[i - 1]) {
                    n++;
                    System.out.println("Клиенти купили банички: " + n + "\nПоследният клиент успя да купи всички закуски, които е планирал ");
                    break;
                } else {
                    n++;
                    System.out.println("Клиенти купили банички: " + n + "\nПоследният клиент успя да купи: " + банички + " от " + quantity[i - 1]);
                    break;
                }
            }
    }
}
